In [1]:
import pandas as pd
import numpy as np

In [2]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378101,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378101
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [3]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378101
(Texas, 2000)         20851820
dtype: int64

In [4]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378101
(Texas, 2010)         25145561
dtype: int64

In [5]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [6]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378101
Texas       2000    20851820
            2010    25145561
dtype: int64

In [7]:
pop[:, 2010]

California    37253956
New York      19378101
Texas         25145561
dtype: int64

In [8]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378101
Texas       20851820  25145561

In [9]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378101
Texas       2000    20851820
            2010    25145561
dtype: int64

In [10]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378101  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [11]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [12]:
df = pd.DataFrame(np.random.rand(4,2),
                  index = [['a','a','b','b'], [1,2,1,2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.266446  0.254882
  2  0.769191  0.637330
b 1  0.526626  0.911911
  2  0.736500  0.748511

In [13]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378101}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378101
dtype: int64

In [14]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [15]:
pd.MultiIndex.from_tuples([('a',1), ('a',2), ('b',1), ('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [16]:
pd.MultiIndex.from_product([['a','b'], [1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [17]:
pd.MultiIndex(levels=[['a','b'], [1,2]],
                      labels=[[0,0,1,1],[0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [18]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378101
Texas       2000    20851820
            2010    25145561
dtype: int64

In [19]:
#hierarchical indicea and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1,2]], names=['year','visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']], names=['subject','type'])

#mock some data
data = np.round(np.random.randn(4,6),1)
data[:, ::2] *= 10
data += 37

#create DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  36.8  48.0  38.1  30.0  37.1
     2      18.0  36.4  50.0  36.5  36.0  36.1
2014 1      43.0  36.2  42.0  36.5  22.0  35.4
     2      25.0  34.4  39.0  37.9  45.0  36.3

In [20]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      48.0  38.1
     2      50.0  36.5
2014 1      42.0  36.5
     2      39.0  37.9

In [21]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378101
Texas       2000    20851820
            2010    25145561
dtype: int64

In [22]:
pop['California', 2000]

33871648

In [23]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [24]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378101
dtype: int64

In [25]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [26]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [27]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [28]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  36.8  48.0  38.1  30.0  37.1
     2      18.0  36.4  50.0  36.5  36.0  36.1
2014 1      43.0  36.2  42.0  36.5  22.0  35.4
     2      25.0  34.4  39.0  37.9  45.0  36.3

In [29]:
health_data['Guido', 'HR']

year  visit
2013  1        48.0
      2        50.0
2014  1        42.0
      2        39.0
Name: (Guido, HR), dtype: float64

In [30]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      36.0  36.8
     2      18.0  36.4

In [31]:
health_data.loc[:, ('Bob','HR')]

year  visit
2013  1        36.0
      2        18.0
2014  1        43.0
      2        25.0
Name: (Bob, HR), dtype: float64

In [33]:
#head_data.loc[(:, 1), (:, 'HR')]

In [34]:
idx = pd.IndexSlice
health_data.loc[idx[:,1], idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      36.0  48.0  30.0
2014 1      43.0  42.0  22.0

In [35]:
index = pd.MultiIndex.from_product([['a','c','b'], [1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.971226
      2      0.846786
c     1      0.401102
      2      0.058093
b     1      0.352151
      2      0.465128
dtype: float64

In [36]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [38]:
data = data.sort_index()
data

char  int
a     1      0.971226
      2      0.846786
b     1      0.352151
      2      0.465128
c     1      0.401102
      2      0.058093
dtype: float64

In [39]:
data['a':'b']

char  int
a     1      0.971226
      2      0.846786
b     1      0.352151
      2      0.465128
dtype: float64

In [40]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378101  25145561

In [41]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378101
Texas       20851820  25145561

In [43]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378101
Texas       2000    20851820
            2010    25145561
dtype: int64

In [44]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378101
4       Texas  2000    20851820
5       Texas  2010    25145561

In [45]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378101
Texas      2000    20851820
           2010    25145561

In [46]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  36.8  48.0  38.1  30.0  37.1
     2      18.0  36.4  50.0  36.5  36.0  36.1
2014 1      43.0  36.2  42.0  36.5  22.0  35.4
     2      25.0  34.4  39.0  37.9  45.0  36.3

In [47]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR   Temp
year
2013     27.0  36.6  49.0  37.3  33.0  36.60
2014     34.0  35.3  40.5  37.2  33.5  35.85

In [48]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  36.333333  36.833333
2014  36.000000  36.116667